using Microsoft.EntityFrameworkCore;
using Microsoft.EntityFrameworkCore.Metadata.Builders;
using Резервирай_Преживяване.Data.Entities;

namespace Резервирай_Преживяване.Data.Configuration
{
    public class ResortConfiguration : IEntityTypeConfiguration<Resort>
    {
        public void Configure(EntityTypeBuilder<Resort> builder)
        {
            builder.HasMany(x => x.Rooms)
                .WithOne(x => x.Resort)
                .HasForeignKey(x => x.ResortId);

            builder.HasOne(x => x.Facility)
                .WithOne(x => x.Resort)
                .HasForeignKey<Facility>(x => x.ResortId);

            builder.HasData(CreateResort());
        }

        private List<Resort> CreateResort()
        {
            var resorts = new List<Resort>()
            {
                new Resort()
                {
                    Id = Guid.Parse("38b0b8f7-271d-4b03-98dc-03e7d6269478"),
                    Name = "Гранд Хотел Княз Павел",
                    Stars = "5",
                    Type = "Хотел",
                    ImageUrl = "https://cf.bstatic.com/xdata/images/hotel/max1024x768/392067768.jpg?k=e35eb4efe7e2385667b4036a21e874eadbe0068335b6a220c838c63308d31c3c&o=&hp=1",
                    Description = "Гранд Хотел Княз Павел се намира в Павел Баня, на 31 км от еко пътека „Бяла река“. " +
                                  "Предлага помещения за настаняване с безплатен частен паркинг, открит плувен басейн, фитнес център и градина. " +
                                  "Този 5-звезден хотел разполага с тераса и климатизирани стаи с безплатен WiFi и самостоятелна баня. " +
                                  "Гостите могат да ползват спа и уелнес центъра със закрит басейн, сауна и хидромасажна вана, както и общия салон. " +
                                  "Всички стаи в хотела включват балкон с изглед към града. Всяка стая е снабдена с кафемашина, а някои стаи имат кухненски бокс с микровълнова фурна. " +
                                  "Стаите за гости в Гранд Хотел Княз Павел са оборудвани с телевизор с плосък екран и сешоар. " +
                                  "В мястото за настаняване ще намерите ресторант, предлагащ местна, международна и европейска кухня. " +
                                  "Гостите могат да заявят вегетариански, безмлечни и халал храни. " +
                                  "Можете да играете тенис на маса в Гранд Хотел Княз Павел, а районът е популярен за колоездене. " +
                                  "Персоналът на денонощната рецепция говори български и английски език. " +
                                  "Връх Шипка е на 36 км от хотела. " +
                                  "Най-близкото летище е международно летище Пловдив, на 104 км от Гранд Хотел Княз Павел. " +
                                  "Летищен трансфер се осигурява срещу допълнително заплащане.",
                    CityId = Guid.Parse("d36b4336-8391-4da7-b0df-e7a2555d07f6"),
                },
                new Resort()
                {
                    Id = Guid.Parse("6016de68-9999-4e82-aee8-ac1f6a9491c3"),
                    Name = "Kings' Valley Medical & Spa Hotel",
                    Stars = "5",
                    Type = "Хотел",
                    ImageUrl = "https://cf.bstatic.com/xdata/images/hotel/max1280x900/481079013.jpg?k=a7de84475d2fc06650a290ebdf1de75ad7306ae9726537a5e775241902869fb7&o=&hp=1",
                    Description = "Хотел Kings' Valley Medical & Spa се намира в Казанлък, на 32 км от търговски център „Мол Галерия“. " +
                                  "Предлага помещения за настаняване със сезонен открит плувен басейн, безплатен частен паркинг, фитнес център и градина. " +
                                  "Разполага с ресторант, тераса, закрит басейн и хидромасажна вана. " +
                                  "Хотелът разполага с вана с гореща минерална вода, рум-сървиз и безплатен WiFi на цялата площ. " +
                                  "Всички стаи в хотела разполагат с климатик, кът за сядане, телевизор с плосък екран със сателитни канали, сейф и собствена баня с биде, безплатни тоалетни принадлежности и сешоар. " +
                                  "Хотел Kings' Valley Medical & Spa предлага някои помещения с балкон, а всички стаи са оборудвани с кафемашина. " +
                                  "Стаите са снабдени със спално бельо и хавлии. " +
                                  "Всяка сутрин в хотел Kings' Valley Medical & Spa се сервира закуска на шведска маса. " +
                                  "Хотелът разполага със СПА център. " +
                                  "В този 5-звезден хотел има тенис корт, а районът е популярно място за колоездене. " +
                                  "Персоналът на рецепцията говори български и английски език и е на разположение денонощно. " +
                                  "Регионалният исторически музей на Стара Загора и художествената галерия на Стара Загора са на 34 км от хотел Kings' Valley Medical & Spa.",
                    CityId = Guid.Parse("f612bb1f-975e-434a-920b-5c886ebe3cc6"),
                },
                new Resort()
                {
                    Id = Guid.Parse("bca59868-70b8-481e-8e66-88b6e4a32fb6"),
                    Name = "Къща за гости Елизабет",
                    Stars = "3",
                    Type = "Къща за гости",
                    ImageUrl = "https://cf.bstatic.com/xdata/images/hotel/max1024x768/30551820.jpg?k=39060232600fb6055f2bc2c60c3a8ff98cb2ea9554f2fb5988d8811083bca462&o=&hp=1",
                    Description = "Къща за гости Елизабет се намира в центъра на Самоков, на 10 минути с кола от ски курорта Боровец. " +
                                  "Предлага лятна градина с кът за сядане, безплатен WiFi във всички части и безплатен собствен паркинг. " +
                                  "Всички стаи в къща за гости Елизабет разполагат с модерни удобства като кабелна телевизия и самостоятелна баня с душ и сешоар. " +
                                  "Някои от просторните помещения за настаняване включват отделна всекидневна, хидромасажна вана и камина. " +
                                  "Малките гости могат да се забавляват на детската площадка в градината. " +
                                  "Около къщата за гости има различни ресторанти и заведения за хранене. " +
                                  "На място се използва машина за химическо чистене, която е подходяща за хора с алергии. " +
                                  "Къща за гости Елизабет е на около 30 минути с кола от минералните извори и плувни басейни в Сапарева баня, Долна баня и Белчински бани.",
                    CityId = Guid.Parse("7a65d489-304c-4be8-b344-7d53a644e080"),
                }
            };

            return resorts;
        }
    }
}
