using Microsoft.EntityFrameworkCore;
using Microsoft.EntityFrameworkCore.Metadata.Builders;
using Резервирай_Преживяване.Data.Entities;

namespace Резервирай_Преживяване.Data.Configuration
{
    public class RoomConfiguration : IEntityTypeConfiguration<Room>
    {
        public void Configure(EntityTypeBuilder<Room> builder)
        {
            builder.HasMany(x => x.RoomReservations)
                .WithOne(x => x.Room)
                .HasForeignKey(x => x.RoomId);

            builder.HasMany(x => x.Images)
                .WithOne(x => x.Room)
                .HasForeignKey(x => x.RoomId);

            builder.HasData(CreateRoom());
        }

        private List<Room> CreateRoom()
        {
            var rooms = new List<Room>()
            {
                new Room()
                {
                    Id = Guid.Parse("7f3c9e9d-124b-4b3c-bbc6-9e157dca781d"),
                    Type = "Двойна стая",
                    Capacity = "2",
                    Description = "Нашите отлично обзаведени стандартни двойни стаи осигуряват незабравим уют и комфорт. " +
                                  "Такава стая разполага с просторна мраморна баня и балкон, две отделни легла, смарт телевизори с многоезични канали и интерактивни услуги за гости. " +
                                  "Интелигентен панел, контролиращ както поддръжката на помещението, така и температурата. " +
                                  "Хигиенни удобства Омния са осигурени във всяка стая.",
                    PricePerNight = 206,
                    ResortId = Guid.Parse("38b0b8f7-271d-4b03-98dc-03e7d6269478"),
                },
                new Room()
                {
                    Id = Guid.Parse("aa797062-fc24-4f63-953d-8a8445b15e7d"),
                    Type = "Двойна стая",
                    Capacity = "2",
                    Description = "Нашите отлично обзаведени стандартни двойни стаи осигуряват незабравим уют и комфорт. " +
                                  "Такава стая разполага с просторна мраморна баня и балкон, две отделни легла, смарт телевизори с многоезични канали и интерактивни услуги за гости. " +
                                  "Интелигентен панел, контролиращ както поддръжката на помещението, така и температурата. " +
                                  "Хигиенни удобства Омния са осигурени във всяка стая.",
                    PricePerNight = 206,
                    ResortId = Guid.Parse("38b0b8f7-271d-4b03-98dc-03e7d6269478"),
                },
                
                new Room()
                {
                    Id = Guid.Parse("9c64d851-359c-410d-a740-3d4033ed8b71"),
                    Type = "Двойна стая",
                    Capacity = "2",
                    Description = "Нашите отлично обзаведени стандартни двойни стаи осигуряват незабравим уют и комфорт. " +
                                  "Такава стая разполага с просторна мраморна баня и балкон, две отделни легла, смарт телевизори с многоезични канали и интерактивни услуги за гости. " +
                                  "Интелигентен панел, контролиращ както поддръжката на помещението, така и температурата. " +
                                  "Хигиенни удобства Омния са осигурени във всяка стая.",
                    PricePerNight = 206,
                    ResortId = Guid.Parse("38b0b8f7-271d-4b03-98dc-03e7d6269478"),
                },
                
                new Room()
                {
                    Id = Guid.Parse("c65343e9-d496-4add-9978-947bee062a81"),
                    Type = "Двойна стая",
                    Capacity = "2",
                    Description = "Нашите отлично обзаведени стандартни двойни стаи осигуряват незабравим уют и комфорт. " +
                                  "Такава стая разполага с просторна мраморна баня и балкон, две отделни легла, смарт телевизори с многоезични канали и интерактивни услуги за гости. " +
                                  "Интелигентен панел, контролиращ както поддръжката на помещението, така и температурата. " +
                                  "Хигиенни удобства Омния са осигурени във всяка стая.",
                    PricePerNight = 206,
                    ResortId = Guid.Parse("38b0b8f7-271d-4b03-98dc-03e7d6269478"),
                },
                
                new Room()
                {
                    Id = Guid.Parse("86a5daf7-e168-4ef4-9b98-f99f50e30151"),
                    Type = "Двойна стая",
                    Capacity = "2",
                    Description = "Нашите отлично обзаведени стандартни двойни стаи осигуряват незабравим уют и комфорт. " +
                                  "Такава стая разполага с просторна мраморна баня и балкон, две отделни легла, смарт телевизори с многоезични канали и интерактивни услуги за гости. " +
                                  "Интелигентен панел, контролиращ както поддръжката на помещението, така и температурата. " +
                                  "Хигиенни удобства Омния са осигурени във всяка стая.",
                    PricePerNight = 206,
                    ResortId = Guid.Parse("38b0b8f7-271d-4b03-98dc-03e7d6269478"),
                },

                new Room()
                {
                    Id = Guid.Parse("428c043a-5142-4197-bbb7-6ccfa3216ec4"),
                    Type = "Апартамент",
                    Capacity = "4",
                    Description = "Нашият отлично обзаведен Гранд суит осигурява незабравим уют и комфорт. " +
                                  "Тази стая разполага с 2 просторни спални, 2 просторни мраморни бани, състоящи се от душ и вана и голям балкон с маса за хранене и няколко люлки. " +
                                  "Всички наши стаи разполагат със смарт телевизори с многоезични канали и интерактивни услуги за гости. " +
                                  "Интелигентен панел, контролиращ както поддръжката на помещението, така и температурата. " +
                                  "Кафе машина Неспресо и хигиенни удобства Омния са осигурени във всяка стая.",
                    PricePerNight = 509,
                    ResortId = Guid.Parse("38b0b8f7-271d-4b03-98dc-03e7d6269478"),
                },

                new Room()
                {
                    Id = Guid.Parse("d1ea883d-29de-4cdc-a5ec-d65a915df524"),
                    Type = "Апартамент",
                    Capacity = "4",
                    Description = "Нашият отлично обзаведен Гранд суит осигурява незабравим уют и комфорт. " +
                                  "Тази стая разполага с 2 просторни спални, 2 просторни мраморни бани, състоящи се от душ и вана и голям балкон с маса за хранене и няколко люлки. " +
                                  "Всички наши стаи разполагат със смарт телевизори с многоезични канали и интерактивни услуги за гости. " +
                                  "Интелигентен панел, контролиращ както поддръжката на помещението, така и температурата. " +
                                  "Кафе машина Неспресо и хигиенни удобства Омния са осигурени във всяка стая.",
                    PricePerNight = 509,
                    ResortId = Guid.Parse("38b0b8f7-271d-4b03-98dc-03e7d6269478"),
                },

                new Room()
                {
                    Id = Guid.Parse("64934542-3e3c-4292-9275-8370a627564d"),
                    Type = "Двойна делукс стая",
                    Capacity = "2",
                    Description = "Нашите луксозно обзаведени двойни стаи предлагат незабравим уют и комфорт. " +
                                  "Такава стая разполага с просторна мраморна баня и балкон. " +
                                  "Всички наши стаи разполагат със спалня или две отделни легла, смарт телевизори с многоезични канали и интерактивни услуги за гости. " +
                                  "Интелигентен панел, контролиращ както поддръжката на помещението, така и температурата. " +
                                  "Хигиенни удобства Омния са осигурени във всяка стая.",
                    PricePerNight = 220,
                    ResortId = Guid.Parse("38b0b8f7-271d-4b03-98dc-03e7d6269478"),
                },

                new Room()
                {
                    Id = Guid.Parse("6f2d2bf9-a88b-4b78-bcaa-3e49ce30dd04"),
                    Type = "Двойна делукс стая",
                    Capacity = "2",
                    Description = "Нашите луксозно обзаведени двойни стаи предлагат незабравим уют и комфорт. " +
                                  "Такава стая разполага с просторна мраморна баня и балкон. " +
                                  "Всички наши стаи разполагат със спалня или две отделни легла, смарт телевизори с многоезични канали и интерактивни услуги за гости. " +
                                  "Интелигентен панел, контролиращ както поддръжката на помещението, така и температурата. " +
                                  "Хигиенни удобства Омния са осигурени във всяка стая.",
                    PricePerNight = 220,
                    ResortId = Guid.Parse("38b0b8f7-271d-4b03-98dc-03e7d6269478"),
                },

                new Room()
                {
                    Id = Guid.Parse("2700d8b7-c588-4435-a761-8c3cb246ea09"),
                    Type = "Студио",
                    Capacity = "2",
                    Description = "Нашите отлично обзаведени стандартни двойни стаи осигуряват незабравим уют и комфорт. " +
                                  "Такава стая разполага с просторна мраморна баня и балкон, две отделни легла, смарт телевизори с многоезични канали и интерактивни услуги за гости. " +
                                  "Интелигентен панел, контролиращ както поддръжката на помещението, така и температурата. " +
                                  "Хигиенни удобства Омния са осигурени във всяка стая.",
                    PricePerNight = 220,
                    ResortId = Guid.Parse("38b0b8f7-271d-4b03-98dc-03e7d6269478"),
                },

                new Room()
                {
                    Id = Guid.Parse("69dec351-64bf-49b4-add7-069abb03735c"),
                    Type = "Студио",
                    Capacity = "2",
                    Description = "Нашите отлично обзаведени стандартни двойни стаи осигуряват незабравим уют и комфорт. " +
                                  "Такава стая разполага с просторна мраморна баня и балкон, две отделни легла, смарт телевизори с многоезични канали и интерактивни услуги за гости. " +
                                  "Интелигентен панел, контролиращ както поддръжката на помещението, така и температурата. " +
                                  "Хигиенни удобства Омния са осигурени във всяка стая.",
                    PricePerNight = 220,
                    ResortId = Guid.Parse("38b0b8f7-271d-4b03-98dc-03e7d6269478"),
                },

                new Room()
                {
                    Id = Guid.Parse("f085410f-9f1c-445c-a054-9c9e2d5dc538"),
                    Type = "Двойна стая",
                    Capacity = "2",
                    Description = "Тази двойна стая предлага разкош и удобство за двама гости. " +
                                  "Обикновено е обзаведена с две отделни легла с висококачествено спално бельо и матраци. " +
                                  "Банята е модерна и стилно обзаведена с висок клас санитарни удобства и елегантни мраморни плочки. " +
                                  "Стаите също разполагат със смарт телевизори и балкони с красив изглед, предлагайки на гостите уютна и комфортна среда за престой.",
                    PricePerNight = 150,
                    ResortId = Guid.Parse("6016de68-9999-4e82-aee8-ac1f6a9491c3"),
                },
                new Room()
                {
                    Id = Guid.Parse("27552f30-4dde-4d85-bad1-4c6b05843fee"),
                    Type = "Двойна стая",
                    Capacity = "2",
                    Description = "Тази двойна стая предлага разкош и удобство за двама гости. " +
                                  "Обикновено е обзаведена с две отделни легла с висококачествено спално бельо и матраци. " +
                                  "Банята е модерна и стилно обзаведена с висок клас санитарни удобства и елегантни мраморни плочки. " +
                                  "Стаите също разполагат със смарт телевизори и балкони с красив изглед, предлагайки на гостите уютна и комфортна среда за престой.",
                    PricePerNight = 150,
                    ResortId = Guid.Parse("6016de68-9999-4e82-aee8-ac1f6a9491c3"),
                },
                new Room()
                {
                    Id = Guid.Parse("180592ca-bea7-4053-bb15-1071c22e0bee"),
                    Type = "Двойна стая",
                    Capacity = "2",
                    Description = "Тази двойна стая предлага разкош и удобство за двама гости. " +
                                  "Обикновено е обзаведена с две отделни легла с висококачествено спално бельо и матраци. " +
                                  "Банята е модерна и стилно обзаведена с висок клас санитарни удобства и елегантни мраморни плочки. " +
                                  "Стаите също разполагат със смарт телевизори и балкони с красив изглед, предлагайки на гостите уютна и комфортна среда за престой.",
                    PricePerNight = 150,
                    ResortId = Guid.Parse("6016de68-9999-4e82-aee8-ac1f6a9491c3"),
                },
                new Room()
                {
                    Id = Guid.Parse("5d90e4f8-dd39-4534-ba7b-e3d44bb049f9"),
                    Type = "Двойна стая",
                    Capacity = "2",
                    Description = "Тази двойна стая предлага разкош и удобство за двама гости. " +
                                  "Обикновено е обзаведена с две отделни легла с висококачествено спално бельо и матраци. " +
                                  "Банята е модерна и стилно обзаведена с висок клас санитарни удобства и елегантни мраморни плочки. " +
                                  "Стаите също разполагат със смарт телевизори и балкони с красив изглед, предлагайки на гостите уютна и комфортна среда за престой.",
                    PricePerNight = 150,
                    ResortId = Guid.Parse("6016de68-9999-4e82-aee8-ac1f6a9491c3"),
                },
                new Room()
                {
                    Id = Guid.Parse("2f4a8de0-5a11-4846-950a-40a566667551"),
                    Type = "Двойна делукс стая",
                    Capacity = "2",
                    Description = "Тази двойна делукс стая е символ на разкош и комфорт, предназначена за двама гости, които ценят изискаността и уютa. " +
                                  "В нея се предлага просторно пространство, разкошно кралско легло, допълнено с висококачествено спално бельо и меки възглавници. " +
                                  "Банята е обичайно обзаведена с изискани детайли и висок клас санитарни удобства, с модерна мраморна облицовка. " +
                                  "Освен това, стаята може да разполага с голям балкон, предлагащ чудесен изглед към околната природа, за да създаде пълноценно усещане за релаксация и лукс.",
                    PricePerNight = 170,
                    ResortId = Guid.Parse("6016de68-9999-4e82-aee8-ac1f6a9491c3"),
                },
                new Room()
                {
                    Id = Guid.Parse("40ff5444-5179-4c83-a1f3-637b50d04bce"),
                    Type = "Двойна делукс стая",
                    Capacity = "2",
                    Description = "Тази двойна делукс стая е символ на разкош и комфорт, предназначена за двама гости, които ценят изискаността и уютa. " +
                                  "В нея се предлага просторно пространство, разкошно кралско легло, допълнено с висококачествено спално бельо и меки възглавници. " +
                                  "Банята е обичайно обзаведена с изискани детайли и висок клас санитарни удобства, с модерна мраморна облицовка. " +
                                  "Освен това, стаята може да разполага с голям балкон, предлагащ чудесен изглед към околната природа, за да създаде пълноценно усещане за релаксация и лукс.",
                    PricePerNight = 170,
                    ResortId = Guid.Parse("6016de68-9999-4e82-aee8-ac1f6a9491c3"),
                },
                new Room()
                {
                    Id = Guid.Parse("d2304ebf-e36c-4ab4-a5cb-4cee96b16594"),
                    Type = "Апартамент",
                    Capacity = "4",
                    Description = "Суитът в хотела представлява върха на лукса и комфорта, като предлага на гостите просторен и стилно обзаведен апартамент. " +
                                  "Този вид стая често включва отделна спалня, просторна дневна зона със собствен бар и елегантен санитарен възел с вана или душ. " +
                                  "Суитът е подходящ за гости, които ценят изисканото удобство и желаят да се насладят на привилегировано пребиваване в хотела.",
                    PricePerNight = 330,
                    ResortId = Guid.Parse("6016de68-9999-4e82-aee8-ac1f6a9491c3"),
                },
                new Room()
                {
                    Id = Guid.Parse("a95989bc-ab2d-43dc-90f7-21f6b4cc6d8c"),
                    Type = "Апартамент",
                    Capacity = "4",
                    Description = "Суитът в хотела представлява върха на лукса и комфорта, като предлага на гостите просторен и стилно обзаведен апартамент. " +
                                  "Този вид стая често включва отделна спалня, просторна дневна зона със собствен бар и елегантен санитарен възел с вана или душ. " +
                                  "Суитът е подходящ за гости, които ценят изисканото удобство и желаят да се насладят на привилегировано пребиваване в хотела.",
                    PricePerNight = 330,
                    ResortId = Guid.Parse("6016de68-9999-4e82-aee8-ac1f6a9491c3"),
                },
                new Room()
                {
                    Id = Guid.Parse("5448199b-bbcf-4ea5-a120-417ca95a5933"),
                    Type = "Двойна стая",
                    Capacity = "2",
                    Description = "Тази двойна стая представлява уютно и функционално обзаведено пространство, предназначено за двама гости. " +
                                  "Разполага с едно двойно легло, съчетано с удобства като частна баня и основни удобства за комфортен престой. " +
                                  "Такива стаи предоставят и приятна атмосфера, която позволява на гостите да се почувстват като у дома си, като същевременно се наслаждават на почивката си в нова среда.",
                    PricePerNight = 77,
                    ResortId = Guid.Parse("bca59868-70b8-481e-8e66-88b6e4a32fb6"),
                },
                new Room()
                {
                    Id = Guid.Parse("814209b2-06f6-47ac-9a3d-e4ac16c7382a"),
                    Type = "Двойна стая",
                    Capacity = "2",
                    Description = "Тази двойна стая представлява уютно и функционално обзаведено пространство, предназначено за двама гости. " +
                                  "Разполага с едно двойно легло, съчетано с удобства като частна баня и основни удобства за комфортен престой. " +
                                  "Такива стаи предоставят и приятна атмосфера, която позволява на гостите да се почувстват като у дома си, като същевременно се наслаждават на почивката си в нова среда.",
                    PricePerNight = 77,
                    ResortId = Guid.Parse("bca59868-70b8-481e-8e66-88b6e4a32fb6"),
                },
                new Room()
                {
                    Id = Guid.Parse("f3ede3a4-fa72-44fb-8553-2c7b992050eb"),
                    Type = "Двойна стая",
                    Capacity = "2",
                    Description = "Тази двойна стая представлява уютно и функционално обзаведено пространство, предназначено за двама гости. " +
                                  "Разполага с едно двойно легло, съчетано с удобства като частна баня и основни удобства за комфортен престой. " +
                                  "Такива стаи предоставят и приятна атмосфера, която позволява на гостите да се почувстват като у дома си, като същевременно се наслаждават на почивката си в нова среда.",
                    PricePerNight = 77,
                    ResortId = Guid.Parse("bca59868-70b8-481e-8e66-88b6e4a32fb6"),
                },
                new Room()
                {
                    Id = Guid.Parse("c67902e0-bfc4-4ea9-8112-d99f1a1a1ad7"),
                    Type = "Двойна делукс стая",
                    Capacity = "2",
                    Description = "Двойната делукс стая представлява изискано и уютно пространство, създадено за двама гости, които търсят по-високо ниво на комфорт и удоволствие. " +
                                  "Разполага с изключително удобно двойно легло, обградено от елегантно спално бельо и меки възглавници. " +
                                  "Банята е модерна и стилно обзаведена, с използване на висок клас санитарни удобства. " +
                                  "Освен това, двойната делукс стая предлага и допълнителни удобства като голям балкон и разкошна гледка, за да осигури на гостите незабравимо преживяване в уютна и разкошна обстановка.",
                    PricePerNight = 85,
                    ResortId = Guid.Parse("bca59868-70b8-481e-8e66-88b6e4a32fb6"),
                },
                new Room()
                {
                    Id = Guid.Parse("59b6ca47-8cde-44fa-a927-a4b68a346e49"),
                    Type = "Двойна делукс стая",
                    Capacity = "2",
                    Description = "Двойната делукс стая представлява изискано и уютно пространство, създадено за двама гости, които търсят по-високо ниво на комфорт и удоволствие. " +
                                  "Разполага с изключително удобно двойно легло, обградено от елегантно спално бельо и меки възглавници. " +
                                  "Банята е модерна и стилно обзаведена, с използване на висок клас санитарни удобства. " +
                                  "Освен това, двойната делукс стая предлага и допълнителни удобства като голям балкон и разкошна гледка, за да осигури на гостите незабравимо преживяване в уютна и разкошна обстановка.",
                    PricePerNight = 85,
                    ResortId = Guid.Parse("bca59868-70b8-481e-8e66-88b6e4a32fb6"),
                },
                new Room()
                {
                    Id = Guid.Parse("e7a0ce16-bd47-423e-9502-9c3f5354cce7"),
                    Type = "Двойна стая",
                    Capacity = "2",
                    Description = "Тази двойна стая предлага разкош и удобство за двама гости. " +
                                  "Обикновено е обзаведена с две отделни легла с висококачествено спално бельо и матраци. " +
                                  "Банята е модерна и стилно обзаведена с висок клас санитарни удобства и елегантни мраморни плочки. " +
                                  "Стаите също разполагат със смарт телевизори и балкони с красив изглед, предлагайки на гостите уютна и комфортна среда за престой.",
                    PricePerNight = 130,
                    ResortId = Guid.Parse("4e2d6327-b6f3-44b0-a892-242ac5e00d35"),
                },
                new Room()
                {
                    Id = Guid.Parse("7fae328e-d8ea-415d-ba51-eb32b9e9dce5"),
                    Type = "Двойна стая",
                    Capacity = "2",
                    Description = "Тази двойна стая предлага разкош и удобство за двама гости. " +
                                  "Обикновено е обзаведена с две отделни легла с висококачествено спално бельо и матраци. " +
                                  "Банята е модерна и стилно обзаведена с висок клас санитарни удобства и елегантни мраморни плочки. " +
                                  "Стаите също разполагат със смарт телевизори и балкони с красив изглед, предлагайки на гостите уютна и комфортна среда за престой.",
                    PricePerNight = 130,
                    ResortId = Guid.Parse("4e2d6327-b6f3-44b0-a892-242ac5e00d35"),
                },
                new Room()
                {
                    Id = Guid.Parse("d2d41dc4-f7ef-4267-af5d-01e413c7f133"),
                    Type = "Двойна стая",
                    Capacity = "2",
                    Description = "Тази двойна стая предлага разкош и удобство за двама гости. " +
                                  "Обикновено е обзаведена с две отделни легла с висококачествено спално бельо и матраци. " +
                                  "Банята е модерна и стилно обзаведена с висок клас санитарни удобства и елегантни мраморни плочки. " +
                                  "Стаите също разполагат със смарт телевизори и балкони с красив изглед, предлагайки на гостите уютна и комфортна среда за престой.",
                    PricePerNight = 130,
                    ResortId = Guid.Parse("4e2d6327-b6f3-44b0-a892-242ac5e00d35"),
                },
                new Room()
                {
                    Id = Guid.Parse("a8c6414d-3e0d-4163-8ad4-40c5bb9b9fc5"),
                    Type = "Двойна делукс стая",
                    Capacity = "2",
                    Description = "Тази двойна делукс стая е символ на разкош и комфорт, предназначена за двама гости, които ценят изискаността и уютa. " +
                                  "В нея се предлага просторно пространство, разкошно кралско легло, допълнено с висококачествено спално бельо и меки възглавници. " +
                                  "Банята е обичайно обзаведена с изискани детайли и висок клас санитарни удобства, с модерна мраморна облицовка. " +
                                  "Освен това, стаята може да разполага с голям балкон, предлагащ чудесен изглед към околната природа, за да създаде пълноценно усещане за релаксация и лукс.",
                    PricePerNight = 160,
                    ResortId = Guid.Parse("4e2d6327-b6f3-44b0-a892-242ac5e00d35"),
                },
                new Room()
                {
                    Id = Guid.Parse("79a20b3e-e31a-4156-970a-f566350de8b4"),
                    Type = "Двойна делукс стая",
                    Capacity = "2",
                    Description = "Тази двойна делукс стая е символ на разкош и комфорт, предназначена за двама гости, които ценят изискаността и уютa. " +
                                  "В нея се предлага просторно пространство, разкошно кралско легло, допълнено с висококачествено спално бельо и меки възглавници. " +
                                  "Банята е обичайно обзаведена с изискани детайли и висок клас санитарни удобства, с модерна мраморна облицовка. " +
                                  "Освен това, стаята може да разполага с голям балкон, предлагащ чудесен изглед към околната природа, за да създаде пълноценно усещане за релаксация и лукс.",
                    PricePerNight = 160,
                    ResortId = Guid.Parse("4e2d6327-b6f3-44b0-a892-242ac5e00d35"),
                },
            };
            return rooms;
        }
    }
}
