using System;
using Microsoft.EntityFrameworkCore.Migrations;

#nullable disable

namespace Резервирай_Преживяване.Migrations
{
    public partial class migr : Migration
    {
        protected override void Up(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.DeleteData(
                table: "Rooms",
                keyColumn: "Id",
                keyValue: new Guid("180592ca-bea7-4053-bb15-1071c22e0bee"));

            migrationBuilder.DeleteData(
                table: "Rooms",
                keyColumn: "Id",
                keyValue: new Guid("27552f30-4dde-4d85-bad1-4c6b05843fee"));

            migrationBuilder.DeleteData(
                table: "Rooms",
                keyColumn: "Id",
                keyValue: new Guid("40ff5444-5179-4c83-a1f3-637b50d04bce"));

            migrationBuilder.DeleteData(
                table: "Rooms",
                keyColumn: "Id",
                keyValue: new Guid("59b6ca47-8cde-44fa-a927-a4b68a346e49"));

            migrationBuilder.DeleteData(
                table: "Rooms",
                keyColumn: "Id",
                keyValue: new Guid("5d90e4f8-dd39-4534-ba7b-e3d44bb049f9"));

            migrationBuilder.DeleteData(
                table: "Rooms",
                keyColumn: "Id",
                keyValue: new Guid("69dec351-64bf-49b4-add7-069abb03735c"));

            migrationBuilder.DeleteData(
                table: "Rooms",
                keyColumn: "Id",
                keyValue: new Guid("6f2d2bf9-a88b-4b78-bcaa-3e49ce30dd04"));

            migrationBuilder.DeleteData(
                table: "Rooms",
                keyColumn: "Id",
                keyValue: new Guid("79a20b3e-e31a-4156-970a-f566350de8b4"));

            migrationBuilder.DeleteData(
                table: "Rooms",
                keyColumn: "Id",
                keyValue: new Guid("7fae328e-d8ea-415d-ba51-eb32b9e9dce5"));

            migrationBuilder.DeleteData(
                table: "Rooms",
                keyColumn: "Id",
                keyValue: new Guid("814209b2-06f6-47ac-9a3d-e4ac16c7382a"));

            migrationBuilder.DeleteData(
                table: "Rooms",
                keyColumn: "Id",
                keyValue: new Guid("86a5daf7-e168-4ef4-9b98-f99f50e30151"));

            migrationBuilder.DeleteData(
                table: "Rooms",
                keyColumn: "Id",
                keyValue: new Guid("9c64d851-359c-410d-a740-3d4033ed8b71"));

            migrationBuilder.DeleteData(
                table: "Rooms",
                keyColumn: "Id",
                keyValue: new Guid("a95989bc-ab2d-43dc-90f7-21f6b4cc6d8c"));

            migrationBuilder.DeleteData(
                table: "Rooms",
                keyColumn: "Id",
                keyValue: new Guid("aa797062-fc24-4f63-953d-8a8445b15e7d"));

            migrationBuilder.DeleteData(
                table: "Rooms",
                keyColumn: "Id",
                keyValue: new Guid("c65343e9-d496-4add-9978-947bee062a81"));

            migrationBuilder.DeleteData(
                table: "Rooms",
                keyColumn: "Id",
                keyValue: new Guid("d1ea883d-29de-4cdc-a5ec-d65a915df524"));

            migrationBuilder.DeleteData(
                table: "Rooms",
                keyColumn: "Id",
                keyValue: new Guid("d2d41dc4-f7ef-4267-af5d-01e413c7f133"));

            migrationBuilder.DeleteData(
                table: "Rooms",
                keyColumn: "Id",
                keyValue: new Guid("f3ede3a4-fa72-44fb-8553-2c7b992050eb"));

            migrationBuilder.UpdateData(
                table: "AspNetRoles",
                keyColumn: "Id",
                keyValue: "528726ea-e421-4a80-b303-f035355599de",
                column: "ConcurrencyStamp",
                value: "fcca65fd-b9f9-4000-9514-b521b4450d04");

            migrationBuilder.UpdateData(
                table: "AspNetRoles",
                keyColumn: "Id",
                keyValue: "5dd65fa9-eb2c-4372-8084-8c501347e74f",
                column: "ConcurrencyStamp",
                value: "20b623ea-edb1-4774-8b66-551b3f53ce26");

            migrationBuilder.UpdateData(
                table: "AspNetUsers",
                keyColumn: "Id",
                keyValue: "d2536968-519d-42d7-9f8a-c14e56bad4ac",
                columns: new[] { "ConcurrencyStamp", "PasswordHash", "SecurityStamp" },
                values: new object[] { "e3f0670f-8fd9-46fd-9b3e-3204c43430dd", "AQAAAAEAACcQAAAAEEEd7kfkvVQxHVkpuCLPkcwKjMv4EuYJ+lxAUOyN1aVPyMvmYsuT/6W5WNJhvqsZEw==", "b7246e24-e45b-4744-886c-e963efd3dbba" });

            migrationBuilder.UpdateData(
                table: "AspNetUsers",
                keyColumn: "Id",
                keyValue: "e067e587-1b89-4dfb-a7dd-cee434dcfc0b",
                columns: new[] { "ConcurrencyStamp", "PasswordHash", "SecurityStamp" },
                values: new object[] { "a0fc70a9-8db3-43f2-bf5f-5953ba59ff4b", "AQAAAAEAACcQAAAAEGZDut/U/KyyMwld22owa6feXhYqd70MfgiwUtk43BjVLR25ZDn7RqH5AqZtGDqwaQ==", "aa308858-b789-4526-8eb9-1a593a2b9972" });

            migrationBuilder.UpdateData(
                table: "Image",
                keyColumn: "Id",
                keyValue: new Guid("7fda1cee-e088-42bd-a96d-7bb2668ff1ac"),
                column: "RoomId",
                value: new Guid("64934542-3e3c-4292-9275-8370a627564d"));
        }

        protected override void Down(MigrationBuilder migrationBuilder)
        {
            migrationBuilder.UpdateData(
                table: "AspNetRoles",
                keyColumn: "Id",
                keyValue: "528726ea-e421-4a80-b303-f035355599de",
                column: "ConcurrencyStamp",
                value: "2026fdd3-199e-46fd-960a-6606526281a7");

            migrationBuilder.UpdateData(
                table: "AspNetRoles",
                keyColumn: "Id",
                keyValue: "5dd65fa9-eb2c-4372-8084-8c501347e74f",
                column: "ConcurrencyStamp",
                value: "008acb85-c307-4df9-909f-1e7310314edd");

            migrationBuilder.UpdateData(
                table: "AspNetUsers",
                keyColumn: "Id",
                keyValue: "d2536968-519d-42d7-9f8a-c14e56bad4ac",
                columns: new[] { "ConcurrencyStamp", "PasswordHash", "SecurityStamp" },
                values: new object[] { "18767715-63dc-4a87-af18-0ff6aaa130b6", "AQAAAAEAACcQAAAAEBAyHBlmrlHAbtWErBC+7+YFYCw1lRNPme88lyfWDNoPUiwZKYXObQDIdtfblI1OZw==", "515c8357-5513-46a5-816d-8f5afad0050e" });

            migrationBuilder.UpdateData(
                table: "AspNetUsers",
                keyColumn: "Id",
                keyValue: "e067e587-1b89-4dfb-a7dd-cee434dcfc0b",
                columns: new[] { "ConcurrencyStamp", "PasswordHash", "SecurityStamp" },
                values: new object[] { "2abded4a-b010-4034-969e-9957d764578a", "AQAAAAEAACcQAAAAEDSfnPCSgKZARYFaT+UdLJsdnKo5w2vGtQKxHCHTosgWynroa+z1dXAmOy3kjKnYHg==", "00932138-55f1-4e7b-9662-59f057c1cc47" });

            migrationBuilder.InsertData(
                table: "Rooms",
                columns: new[] { "Id", "Capacity", "Description", "PricePerNight", "ResortId", "Type" },
                values: new object[,]
                {
                    { new Guid("180592ca-bea7-4053-bb15-1071c22e0bee"), "2", "Тази двойна стая предлага разкош и удобство за двама гости. Обикновено е обзаведена с две отделни легла с висококачествено спално бельо и матраци. Банята е модерна и стилно обзаведена с висок клас санитарни удобства и елегантни мраморни плочки. Стаите също разполагат със смарт телевизори и балкони с красив изглед, предлагайки на гостите уютна и комфортна среда за престой.", 150m, new Guid("6016de68-9999-4e82-aee8-ac1f6a9491c3"), "Двойна стая" },
                    { new Guid("27552f30-4dde-4d85-bad1-4c6b05843fee"), "2", "Тази двойна стая предлага разкош и удобство за двама гости. Обикновено е обзаведена с две отделни легла с висококачествено спално бельо и матраци. Банята е модерна и стилно обзаведена с висок клас санитарни удобства и елегантни мраморни плочки. Стаите също разполагат със смарт телевизори и балкони с красив изглед, предлагайки на гостите уютна и комфортна среда за престой.", 150m, new Guid("6016de68-9999-4e82-aee8-ac1f6a9491c3"), "Двойна стая" },
                    { new Guid("40ff5444-5179-4c83-a1f3-637b50d04bce"), "2", "Тази двойна делукс стая е символ на разкош и комфорт, предназначена за двама гости, които ценят изискаността и уютa. В нея се предлага просторно пространство, разкошно кралско легло, допълнено с висококачествено спално бельо и меки възглавници. Банята е обичайно обзаведена с изискани детайли и висок клас санитарни удобства, с модерна мраморна облицовка. Освен това, стаята може да разполага с голям балкон, предлагащ чудесен изглед към околната природа, за да създаде пълноценно усещане за релаксация и лукс.", 170m, new Guid("6016de68-9999-4e82-aee8-ac1f6a9491c3"), "Двойна делукс стая" },
                    { new Guid("59b6ca47-8cde-44fa-a927-a4b68a346e49"), "2", "Двойната делукс стая представлява изискано и уютно пространство, създадено за двама гости, които търсят по-високо ниво на комфорт и удоволствие. Разполага с изключително удобно двойно легло, обградено от елегантно спално бельо и меки възглавници. Банята е модерна и стилно обзаведена, с използване на висок клас санитарни удобства. Освен това, двойната делукс стая предлага и допълнителни удобства като голям балкон и разкошна гледка, за да осигури на гостите незабравимо преживяване в уютна и разкошна обстановка.", 85m, new Guid("bca59868-70b8-481e-8e66-88b6e4a32fb6"), "Двойна делукс стая" },
                    { new Guid("5d90e4f8-dd39-4534-ba7b-e3d44bb049f9"), "2", "Тази двойна стая предлага разкош и удобство за двама гости. Обикновено е обзаведена с две отделни легла с висококачествено спално бельо и матраци. Банята е модерна и стилно обзаведена с висок клас санитарни удобства и елегантни мраморни плочки. Стаите също разполагат със смарт телевизори и балкони с красив изглед, предлагайки на гостите уютна и комфортна среда за престой.", 150m, new Guid("6016de68-9999-4e82-aee8-ac1f6a9491c3"), "Двойна стая" },
                    { new Guid("69dec351-64bf-49b4-add7-069abb03735c"), "2", "Нашите отлично обзаведени стандартни двойни стаи осигуряват незабравим уют и комфорт. Такава стая разполага с просторна мраморна баня и балкон, две отделни легла, смарт телевизори с многоезични канали и интерактивни услуги за гости. Интелигентен панел, контролиращ както поддръжката на помещението, така и температурата. Хигиенни удобства Омния са осигурени във всяка стая.", 220m, new Guid("38b0b8f7-271d-4b03-98dc-03e7d6269478"), "Студио" },
                    { new Guid("6f2d2bf9-a88b-4b78-bcaa-3e49ce30dd04"), "2", "Нашите луксозно обзаведени двойни стаи предлагат незабравим уют и комфорт. Такава стая разполага с просторна мраморна баня и балкон. Всички наши стаи разполагат със спалня или две отделни легла, смарт телевизори с многоезични канали и интерактивни услуги за гости. Интелигентен панел, контролиращ както поддръжката на помещението, така и температурата. Хигиенни удобства Омния са осигурени във всяка стая.", 220m, new Guid("38b0b8f7-271d-4b03-98dc-03e7d6269478"), "Двойна делукс стая" },
                    { new Guid("79a20b3e-e31a-4156-970a-f566350de8b4"), "2", "Тази двойна делукс стая е символ на разкош и комфорт, предназначена за двама гости, които ценят изискаността и уютa. В нея се предлага просторно пространство, разкошно кралско легло, допълнено с висококачествено спално бельо и меки възглавници. Банята е обичайно обзаведена с изискани детайли и висок клас санитарни удобства, с модерна мраморна облицовка. Освен това, стаята може да разполага с голям балкон, предлагащ чудесен изглед към околната природа, за да създаде пълноценно усещане за релаксация и лукс.", 160m, new Guid("4e2d6327-b6f3-44b0-a892-242ac5e00d35"), "Двойна делукс стая" },
                    { new Guid("7fae328e-d8ea-415d-ba51-eb32b9e9dce5"), "2", "Тази двойна стая предлага разкош и удобство за двама гости. Обикновено е обзаведена с две отделни легла с висококачествено спално бельо и матраци. Банята е модерна и стилно обзаведена с висок клас санитарни удобства и елегантни мраморни плочки. Стаите също разполагат със смарт телевизори и балкони с красив изглед, предлагайки на гостите уютна и комфортна среда за престой.", 130m, new Guid("4e2d6327-b6f3-44b0-a892-242ac5e00d35"), "Двойна стая" },
                    { new Guid("814209b2-06f6-47ac-9a3d-e4ac16c7382a"), "2", "Тази двойна стая представлява уютно и функционално обзаведено пространство, предназначено за двама гости. Разполага с едно двойно легло, съчетано с удобства като частна баня и основни удобства за комфортен престой. Такива стаи предоставят и приятна атмосфера, която позволява на гостите да се почувстват като у дома си, като същевременно се наслаждават на почивката си в нова среда.", 77m, new Guid("bca59868-70b8-481e-8e66-88b6e4a32fb6"), "Двойна стая" },
                    { new Guid("86a5daf7-e168-4ef4-9b98-f99f50e30151"), "2", "Нашите отлично обзаведени стандартни двойни стаи осигуряват незабравим уют и комфорт. Такава стая разполага с просторна мраморна баня и балкон, две отделни легла, смарт телевизори с многоезични канали и интерактивни услуги за гости. Интелигентен панел, контролиращ както поддръжката на помещението, така и температурата. Хигиенни удобства Омния са осигурени във всяка стая.", 206m, new Guid("38b0b8f7-271d-4b03-98dc-03e7d6269478"), "Двойна стая" },
                    { new Guid("9c64d851-359c-410d-a740-3d4033ed8b71"), "2", "Нашите отлично обзаведени стандартни двойни стаи осигуряват незабравим уют и комфорт. Такава стая разполага с просторна мраморна баня и балкон, две отделни легла, смарт телевизори с многоезични канали и интерактивни услуги за гости. Интелигентен панел, контролиращ както поддръжката на помещението, така и температурата. Хигиенни удобства Омния са осигурени във всяка стая.", 206m, new Guid("38b0b8f7-271d-4b03-98dc-03e7d6269478"), "Двойна стая" },
                    { new Guid("a95989bc-ab2d-43dc-90f7-21f6b4cc6d8c"), "4", "Суитът в хотела представлява върха на лукса и комфорта, като предлага на гостите просторен и стилно обзаведен апартамент. Този вид стая често включва отделна спалня, просторна дневна зона със собствен бар и елегантен санитарен възел с вана или душ. Суитът е подходящ за гости, които ценят изисканото удобство и желаят да се насладят на привилегировано пребиваване в хотела.", 330m, new Guid("6016de68-9999-4e82-aee8-ac1f6a9491c3"), "Апартамент" },
                    { new Guid("aa797062-fc24-4f63-953d-8a8445b15e7d"), "2", "Нашите отлично обзаведени стандартни двойни стаи осигуряват незабравим уют и комфорт. Такава стая разполага с просторна мраморна баня и балкон, две отделни легла, смарт телевизори с многоезични канали и интерактивни услуги за гости. Интелигентен панел, контролиращ както поддръжката на помещението, така и температурата. Хигиенни удобства Омния са осигурени във всяка стая.", 206m, new Guid("38b0b8f7-271d-4b03-98dc-03e7d6269478"), "Двойна стая" },
                    { new Guid("c65343e9-d496-4add-9978-947bee062a81"), "2", "Нашите отлично обзаведени стандартни двойни стаи осигуряват незабравим уют и комфорт. Такава стая разполага с просторна мраморна баня и балкон, две отделни легла, смарт телевизори с многоезични канали и интерактивни услуги за гости. Интелигентен панел, контролиращ както поддръжката на помещението, така и температурата. Хигиенни удобства Омния са осигурени във всяка стая.", 206m, new Guid("38b0b8f7-271d-4b03-98dc-03e7d6269478"), "Двойна стая" },
                    { new Guid("d1ea883d-29de-4cdc-a5ec-d65a915df524"), "4", "Нашият отлично обзаведен Гранд суит осигурява незабравим уют и комфорт. Тази стая разполага с 2 просторни спални, 2 просторни мраморни бани, състоящи се от душ и вана и голям балкон с маса за хранене и няколко люлки. Всички наши стаи разполагат със смарт телевизори с многоезични канали и интерактивни услуги за гости. Интелигентен панел, контролиращ както поддръжката на помещението, така и температурата. Кафе машина Неспресо и хигиенни удобства Омния са осигурени във всяка стая.", 509m, new Guid("38b0b8f7-271d-4b03-98dc-03e7d6269478"), "Апартамент" },
                    { new Guid("d2d41dc4-f7ef-4267-af5d-01e413c7f133"), "2", "Тази двойна стая предлага разкош и удобство за двама гости. Обикновено е обзаведена с две отделни легла с висококачествено спално бельо и матраци. Банята е модерна и стилно обзаведена с висок клас санитарни удобства и елегантни мраморни плочки. Стаите също разполагат със смарт телевизори и балкони с красив изглед, предлагайки на гостите уютна и комфортна среда за престой.", 130m, new Guid("4e2d6327-b6f3-44b0-a892-242ac5e00d35"), "Двойна стая" },
                    { new Guid("f3ede3a4-fa72-44fb-8553-2c7b992050eb"), "2", "Тази двойна стая представлява уютно и функционално обзаведено пространство, предназначено за двама гости. Разполага с едно двойно легло, съчетано с удобства като частна баня и основни удобства за комфортен престой. Такива стаи предоставят и приятна атмосфера, която позволява на гостите да се почувстват като у дома си, като същевременно се наслаждават на почивката си в нова среда.", 77m, new Guid("bca59868-70b8-481e-8e66-88b6e4a32fb6"), "Двойна стая" }
                });

            migrationBuilder.UpdateData(
                table: "Image",
                keyColumn: "Id",
                keyValue: new Guid("7fda1cee-e088-42bd-a96d-7bb2668ff1ac"),
                column: "RoomId",
                value: new Guid("6f2d2bf9-a88b-4b78-bcaa-3e49ce30dd04"));
        }
    }
}
